---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.FaceWithTagId
enum: Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType
source: html/71dafbc2-6ff2-5931-9d31-66f206a65476.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.FaceWithTagId

Face identified by integer tag.